# LEETCODE QUESTIONS FOR PANDAS

In [7]:
## Create dataframe from list
"""Write a solution to create a DataFrame from a 2D list called student_data. This 2D list contains the IDs and ages of some students.

The DataFrame should have two columns, student_id and age, and be in the same order as the original 2D list.

The result format is in the following example.

 

Example 1:

Input:
student_data:
[
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]
Output:
+------------+-----+
| student_id | age |
+------------+-----+
| 1          | 15  |
| 2          | 11  |
| 3          | 11  |
| 4          | 20  |
+------------+-----+
Explanation:
A DataFrame was created on top of student_data, with two columns named student_id and age."""

import pandas as pd

def createDataframe(student_data: list[list[int]]) -> pd.DataFrame:
    return pd.DataFrame(student_data, columns=['student_id', 'age'])
    #return df

In [8]:
student_data = [[1,15],[2,11],[3,11],[4,20]]
createDataframe(student_data)

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

In [9]:
"""DataFrame players:
+-------------+--------+
| Column Name | Type   |
+-------------+--------+
| player_id   | int    |
| name        | object |
| age         | int    |
| position    | object |
| ...         | ...    |
+-------------+--------+
Write a solution to calculate and display the number of rows and columns of players.

Return the result as an array:

[number of rows, number of columns]

The result format is in the following example.

 

Example 1:

Input:
+-----------+----------+-----+-------------+--------------------+
| player_id | name     | age | position    | team               |
+-----------+----------+-----+-------------+--------------------+
| 846       | Mason    | 21  | Forward     | RealMadrid         |
| 749       | Riley    | 30  | Winger      | Barcelona          |
| 155       | Bob      | 28  | Striker     | ManchesterUnited   |
| 583       | Isabella | 32  | Goalkeeper  | Liverpool          |
| 388       | Zachary  | 24  | Midfielder  | BayernMunich       |
| 883       | Ava      | 23  | Defender    | Chelsea            |
| 355       | Violet   | 18  | Striker     | Juventus           |
| 247       | Thomas   | 27  | Striker     | ParisSaint-Germain |
| 761       | Jack     | 33  | Midfielder  | ManchesterCity     |
| 642       | Charlie  | 36  | Center-back | Arsenal            |
+-----------+----------+-----+-------------+--------------------+
Output:
[10, 5]
Explanation:
This DataFrame contains 10 rows and 5 columns."""

import numpy as np
def getDataframeSize(players: pd.DataFrame) -> list[int]:
    return list(np.array(players).shape)

getDataframeSize(student_data)

[4, 2]

In [10]:
"""Creating a dictionary from a list"""

# initializing list
test_list1 = ["gfg", "is", "best"] 
test_list2 = ['hi', 'bye', 'cya']
test_list3 = [1,2,3]

print(f"The original list is {test_list1}")
print(f"The second list is {test_list2}")
print(f"The third list is {test_list3}")

zip1 = zip(test_list1, test_list2)
dict1 = dict(zip(test_list3, zip1))
print(f"The resulting dictionary using the 3 lists is {dict1}")

The original list is ['gfg', 'is', 'best']
The second list is ['hi', 'bye', 'cya']
The third list is [1, 2, 3]
The resulting dictionary using the 3 lists is {1: ('gfg', 'hi'), 2: ('is', 'bye'), 3: ('best', 'cya')}

In [11]:
# Using zip function.
keys = ['name', 'age', 'city']
values = ['John', 25, 'New York']

dictionary = dict(zip(keys, values))
print(dictionary)

# Using List comprehension
dictionary2 = {key: value for key,value in zip(keys, values)}
print(dictionary2)

{'name': 'John', 'age': 25, 'city': 'New York'}
{'name': 'John', 'age': 25, 'city': 'New York'}

In [12]:
# Converting a list of tuples into a dictionary. To do this we use dict() constructor. It takes only one argument.

color=[('red',1),('blue',2),('green',3)]

d = dict(color)
print(d)

{'red': 1, 'blue': 2, 'green': 3}

In [13]:
# Converting 2 lists of different sizes into a dictionary.
from itertools import zip_longest

lista = [1,2,3,4,54,56,6,7,8,9]
listb = ('a,b,c,d').split(',')
listc = ('a b c d e f g h').split()
dict2= zip_longest(lista, listb)

In [14]:
print(listb)
print(listc)
print(dict(dict2))

['a', 'b', 'c', 'd']
['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
{1: 'a', 2: 'b', 3: 'c', 4: 'd', 54: None, 56: None, 6: None, 7: None, 8: None, 9: None}

In [15]:
# Selecting data based on a condition.

def selectData(students: pd.DataFrame) -> pd.DataFrame:
    print(students[students["student_id"]==101])
    #print(students[students["student_id"]==101, ['name', 'age']])
    return students.loc[students["student_id"] == 101,["name", "age"]]
    

student_id = [101,53,128,3]
name = ('Uday Ajay Jack John').split()
age = [13,14,13,12]

df1 = pd.DataFrame({'student_id': student_id, 'name':name, 'age': age})
print(df1)

selectData(df1)

   student_id  name  age
0         101  Uday   13
1          53  Ajay   14
2         128  Jack   13
3           3  John   12
   student_id  name  age
0         101  Uday   13

   name  age
0  Uday   13

In [16]:
# Creating a new column

df1['age_squared'] = df1['age']**2
print(df1)

   student_id  name  age  age_squared
0         101  Uday   13          169
1          53  Ajay   14          196
2         128  Jack   13          169
3           3  John   12          144

In [17]:
# Creating a new row in a dataframe.
# The new line should be passed as a disctionary into a new dataframe first. To do this if we are passing in values as a scalar and not as a list
# then we have to pass an index. Else we have to pass it as a list first.
df2 = pd.DataFrame({'student_id':[121], 'name':['Justin'], 'age': [14], 'age_squared': [196]})
print(df2)

# OR
df3 = pd.DataFrame({'student_id':130, 'name': 'yasmin', 'age': 15, 'age_squared': 225},index=[0])
print(df3)


df1 = pd.concat([df1,df2,df3], axis=0)
print(df1)

   student_id    name  age  age_squared
0         121  Justin   14          196
   student_id    name  age  age_squared
0         130  yasmin   15          225
   student_id    name  age  age_squared
0         101    Uday   13          169
1          53    Ajay   14          196
2         128    Jack   13          169
3           3    John   12          144
0         121  Justin   14          196
0         130  yasmin   15          225

In [18]:
df4 = pd.DataFrame({'student_id':[121,140,149], 'name':['Justin', 'sofi', 'frooti' ], 'age': [14,12,11], 'age_squared': [196,144,121]})
print(df4)

   student_id    name  age  age_squared
0         121  Justin   14          196
1         140    sofi   12          144
2         149  frooti   11          121

In [19]:
#Drop duplicate rows

df1.drop_duplicates(inplace=True)
print(df1)

   student_id    name  age  age_squared
0         101    Uday   13          169
1          53    Ajay   14          196
2         128    Jack   13          169
3           3    John   12          144
0         121  Justin   14          196
0         130  yasmin   15          225

In [20]:
# Rename columns in a dataframe

def renameColumns(students: pd.DataFrame) -> pd.DataFrame:
    return students.rename(columns={'id':'student_id','first': 'first_name', 'last': 'last_name', 'age': 'age_in_years'})

In [21]:
# Change datatype of a column

def changeDatatype(students: pd.DataFrame) -> pd.DataFrame:
    students['grade'] = students['grade'].astype(int)
    return students

In [22]:
df5 = pd.read_csv('data1.csv')
df5.head()

             city       month  temperature
0   Jacksonville    January             13
1   Jacksonville    February            23
2   Jacksonville    March               38
3   Jacksonville    April                5
4   Jacksonville    May                 34

In [23]:
df5.rename(columns={' city':'city',' month':'month', 'temperature':'temperature'}, inplace=True)

In [24]:
df5.columns

Index(['city', 'month', 'temperature'], dtype='object')

In [25]:
# Creating a pivot table

df_pivot = pd.pivot_table(df5,index='month', columns='city', values='temperature',aggfunc='max')
df_pivot

city       ElPaso         Jacksonville
month
April                  2              5
February               6             23
January               20             13
March                 26             38
May                   43             34

In [26]:
# Un-pivot the data
df6 = pd.read_csv('data2.csv')
print(df6)

print('\n')

df_melt = pd.melt(df6,id_vars=['product'], var_name='quarter',value_name='sales')
print(df_melt)

         product  quarter_1  quarter_2  quarter_3  quarter_4
0   Umbrella            417        224        379        611
1   SleepingBag         800        936         93        875


         product    quarter  sales
0   Umbrella      quarter_1    417
1   SleepingBag   quarter_1    800
2   Umbrella      quarter_2    224
3   SleepingBag   quarter_2    936
4   Umbrella      quarter_3    379
5   SleepingBag   quarter_3     93
6   Umbrella      quarter_4    611
7   SleepingBag   quarter_4    875

In [27]:
df7 = pd.pivot_table(df_melt, index='product', columns='quarter', values='sales', aggfunc = 'sum')
df7

quarter       quarter_1  quarter_2  quarter_3  quarter_4
product
SleepingBag         800        936         93        875
Umbrella            417        224        379        611

In [28]:
df8 = pd.read_csv('data3.csv')
print(df8)

import pandas as pd

def article_views(views: pd.DataFrame) -> pd.DataFrame:
    return pd.DataFrame(views[views['author_id'] == views['viewer_id']]['author_id']).sort_values('author_id').drop_duplicates('author_id', ignore_index=True).rename(columns={'author_id':'id'})

article_views(df8)

   article_id  author_id  viewer_id     view_date
0           1          3          5   2019-08-01
1           1          3          6   2019-08-02
2           2          7          7   2019-08-01
3           2          7          6   2019-08-02
4           4          7          1   2019-07-22
5           3          4          4   2019-07-21
6           3          4          4   2019-07-21

   id
0   4
1   7

In [29]:
# COunting length of string and filtering it based on it.

str = "my name is Justin"
print(len(str))

def invalid_tweets(tweets: pd.DataFrame) -> pd.DataFrame:
    return tweets.loc[tweets['content'].str.len() > 15, ['tweet_id']]

17

In [30]:
df6['product'][0][1]

'U'

In [31]:
"""Table: Employees

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| employee_id | int     |
| name        | varchar |
| salary      | int     |
+-------------+---------+
employee_id is the primary key (column with unique values) for this table.
Each row of this table indicates the employee ID, employee name, and salary.
 

Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

The result format is in the following example.

 

Example 1:

Input: 
Employees table:
+-------------+---------+--------+
| employee_id | name    | salary |
+-------------+---------+--------+
| 2           | Meir    | 3000   |
| 3           | Michael | 3800   |
| 7           | Addilyn | 7400   |
| 8           | Juan    | 6100   |
| 9           | Kannon  | 7700   |
+-------------+---------+--------+
Output: 
+-------------+-------+
| employee_id | bonus |
+-------------+-------+
| 2           | 0     |
| 3           | 0     |
| 7           | 7400  |
| 8           | 0     |
| 9           | 7700  |
+-------------+-------+
Explanation: 
The employees with IDs 2 and 8 get 0 bonus because they have an even employee_id.
The employee with ID 3 gets 0 bonus because their name starts with 'M'.
The rest of the employees get a 100% bonus."""

def calculate_special_bonus(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus'] = 0
    employees.loc[(employees['employee_id'] % 2 != 0) & (~employees['name'].str.startswith('M')), 'bonus'] = employees['salary']
    result_df = employees[['employee_id', 'bonus']].sort_values(by='employee_id', ascending=True)
    return result_df

In [32]:
"""Table: Users

+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| user_id        | int     |
| name           | varchar |
+----------------+---------+
user_id is the primary key (column with unique values) for this table.
This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters.
 

Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

The result format is in the following example.

 

Example 1:

Input: 
Users table:
+---------+-------+
| user_id | name  |
+---------+-------+
| 1       | aLice |
| 2       | bOB   |
+---------+-------+
Output: 
+---------+-------+
| user_id | name  |
+---------+-------+
| 1       | Alice |
| 2       | Bob   |
+---------+-------+"""

def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users['name'] = users['name'].str.capitalize()
    return users['name'].sort_values(by='user_id', ascending=True)

In [33]:
"""Table: Users

+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| user_id       | int     |
| name          | varchar |
| mail          | varchar |
+---------------+---------+
user_id is the primary key (column with unique values) for this table.
This table contains information of the users signed up in a website. Some e-mails are invalid.
 

Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.
"""
# SOLUTION
"""The regex pattern r'^[A-Za-z][\w\.-]*@leetcode\.com$' is used to match valid email addresses.

^: Start of the string.
[A-Za-z]: Matches any single uppercase or lowercase letter.
[\w\.-]: This matches any single character that is a word character (\w), a period (.), or a dash (-).
*: This means that the preceding character class can appear zero or more times.
@leetcode\.com: Matches the domain @leetcode.com. The backslash before the dot (\.) is used to escape the dot, which normally matches any character 
in regex.
The $ at the end of the pattern asserts the position at the end of the string.
the r in front of the string denotes a raw string in Python. Raw strings are prefixed with r or R and treat backslashes (\) as literal characters. 
This means that characters following a backslash are not interpreted as escape sequences.

Explanation of [\w\.-]*:
[...]: This denotes a character class, which matches any one of the characters inside the brackets.
\w: This matches any word character (alphanumeric character plus underscore). It is equivalent to [a-zA-Z0-9_].
\.: This matches a literal period (.). The backslash (\) is used to escape the period, as a period in regex normally matches any character.
-: This matches a literal dash (-).
*: This is a quantifier that matches zero or more occurrences of the preceding element.

Raw String Usage:
By using a raw string (r'...'), we ensure that the backslashes in the regex pattern are treated literally and not as escape sequences. 
This simplifies the pattern and avoids potential errors.

For example, in a normal string, to represent a literal backslash followed by a dot, you would need to double the backslashes: '\\.'.
Using a raw string allows you to write it more naturally: r'\.'.
Without Raw String:
If you didn't use a raw string, you would need to escape the backslashes, making the regex harder to read and maintain:

return users[users['mail'].str.match('^[A-Za-z][\\w\\.-]*@leetcode\\.com')]
Using raw strings for regex patterns is a common practice in Python because it keeps the regex more readable and reduces the likelihood 
of mistakes with escaping special characters.
"""

# select * from users where regexp_like (mail,'^[a-zA-Z][A-Za-z0-9_.-]*@leetcode[.]com$);
# SELECT * FROM Users WHERE mail REGEXP '^[a-zA-Z][a-zA-Z0-9_.-]*@leetcode[.]com$';

def valid_emails(users: pd.DataFrame) -> pd.DataFrame:
    return users[users['mail'].str.match(r'^[A-Za-z][\w\.-]*@leetcode\.com$')]

In [34]:
# Pattern match

"""Table: Patients

+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| patient_id   | int     |
| patient_name | varchar |
| conditions   | varchar |
+--------------+---------+
patient_id is the primary key (column with unique values) for this table.
'conditions' contains 0 or more code separated by spaces. 
This table contains information of the patients in the hospital.
 

Write a solution to find the patient_id, patient_name, and conditions of the patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Patients table:
+------------+--------------+--------------+
| patient_id | patient_name | conditions   |
+------------+--------------+--------------+
| 1          | Daniel       | YFEV COUGH   |
| 2          | Alice        |              |
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 |
| 5          | Alain        | DIAB201      |
+------------+--------------+--------------+
Output: 
+------------+--------------+--------------+
| patient_id | patient_name | conditions   |
+------------+--------------+--------------+
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 | 
+------------+--------------+--------------+
Explanation: Bob and George both have a condition that starts with DIAB1."""

def find_patients(patients: pd.DataFrame) -> pd.DataFrame:
    patient = patients.loc[patients['conditions'].str.contains(r'\bDIAB1')]
    return patient

In [35]:
df7 = pd.read_csv('data4.csv')
df7.head()

   id  salary
0   1     100
1   2     200
2   3     300
3   4     300
4   5     450

In [50]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    employee_sort = employee.sort_values(by='salary', ascending=False).drop_duplicates(subset=['salary'])
    employee_df = pd.DataFrame(employee_sort.iloc[N-1:N]['salary'])
    print(employee_df)
    print(type(employee_df))
    employee_df.rename(columns={'salary': f'getNthHighestSalary({N})'}, inplace=True)
    print(employee_df)
    return employee_df
    #result_df = pd.DataFrame(employee_df[f'getNthHighestSalary({N})'])
    #return result_df

nth_highest_salary(df7,3)

   salary
5     400
<class 'pandas.core.frame.DataFrame'>
   getNthHighestSalary(3)
5                     400

   getNthHighestSalary(3)
5                     400